test_cases/3d/aero_10h_3d/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         table (
    (0.00000 (0.07376 0 0))
    (0.05000 (0.34732 0 0))
    (0.10000 (0.41285 0 0))
    (0.15000 (0.45676 0 0))
    (0.20000 (0.49073 0 0))
    (0.25000 (0.51881 0 0))
    (0.30000 (0.54293 0 0))
    (0.35000 (0.56421 0 0))
    (0.40000 (0.58331 0 0))
    (0.45000 (0.60069 0 0))
    (0.50000 (0.61668 0 0))
    (0.55000 (0.63151 0 0))
    (0.60000 (0.64536 0 0))
    (0.65000 (0.65837 0 0))
    (0.70000 (0.67064 0 0))
    (0.75000 (0.68228 0 0))
    (0.80000 (0.69335 0 0))
    (0.85000 (0.70391 0 0))
    (0.90000 (0.71401 0 0))
    (0.95000 (0.72370 0 0))
    (1.00000 (0.73301 0 0))
    (1.05000 (0.74198 0 0))
    (1.10000 (0.75064 0 0))
    (1.15000 (0.75901 0 0))
    (1.20000 (0.76710 0 0))
    (1.25000 (0.77495 0 0))
    (1.30000 (0.78257 0 0))
    (1.35000 (0.78996 0 0))
    (1.40000 (0.79716 0 0))
    (1.45000 (0.80416 0 0))
    (1.50000 (0.81099 0 0))
    (1.55000 (0.81765 0 0))
    (1.60000 (0.82415 0 0))
    (1.65000 (0.83049 0 0))
    (1.70000 (0.83670 0 0))
    (1.75000 (0.84277 0 0))
    (1.80000 (0.84871 0 0))
    (1.85000 (0.85452 0 0))
    (1.90000 (0.86022 0 0))
    (1.95000 (0.86581 0 0))
    (2.00000 (0.87130 0 0))
    (2.05000 (0.87668 0 0))
    (2.10000 (0.88196 0 0))
    (2.15000 (0.88715 0 0))
    (2.20000 (0.89225 0 0))
    (2.25000 (0.89726 0 0))
    (2.30000 (0.90219 0 0))
    (2.35000 (0.90704 0 0))
    (2.40000 (0.91182 0 0))
    (2.45000 (0.91652 0 0))
    (2.50000 (0.92114 0 0))
    (2.55000 (0.92570 0 0))
    (2.60000 (0.93020 0 0))
    (2.65000 (0.93462 0 0))
    (2.70000 (0.93899 0 0))
    (2.75000 (0.94330 0 0))
    (2.80000 (0.94754 0 0))
    (2.85000 (0.95173 0 0))
    (2.90000 (0.95587 0 0))
    (2.95000 (0.95995 0 0))
    (3.00000 (0.96398 0 0))
    (3.05000 (0.96796 0 0))
    (3.10000 (0.97190 0 0))
    (3.15000 (0.97578 0 0))
    (3.20000 (0.97962 0 0))
    (3.25000 (0.98341 0 0))
    (3.30000 (0.98716 0 0))
    (3.35000 (0.99087 0 0))
    (3.40000 (0.99454 0 0))
    (3.45000 (0.99817 0 0))
    (3.50000 (1.00175 0 0))
    (3.55000 (1.00530 0 0))
    (3.60000 (1.00881 0 0))
    (3.65000 (1.01229 0 0))
    (3.70000 (1.01573 0 0))
    (3.75000 (1.01913 0 0))
    (3.80000 (1.02251 0 0))
    (3.85000 (1.02584 0 0))
    (3.90000 (1.02915 0 0))
    (3.95000 (1.03242 0 0))
    (4.00000 (1.03567 0 0))
    (4.05000 (1.03888 0 0))
    (4.10000 (1.04206 0 0))
    (4.15000 (1.04522 0 0))
    (4.20000 (1.04834 0 0))
    (4.25000 (1.05144 0 0))
    (4.30000 (1.05451 0 0))
    (4.35000 (1.05755 0 0))
    (4.40000 (1.06057 0 0))
    (4.45000 (1.06356 0 0))
    (4.50000 (1.06653 0 0))
    (4.55000 (1.06947 0 0))
    (4.60000 (1.07239 0 0))
    (4.65000 (1.07528 0 0))
    (4.70000 (1.07816 0 0))
    (4.75000 (1.08100 0 0))
    (4.80000 (1.08383 0 0))
    (4.85000 (1.08663 0 0))
    (4.90000 (1.08942 0 0))
    (4.95000 (1.09218 0 0))
    (5.00000 (1.09492 0 0))
    (5.05000 (1.09764 0 0))
    (5.10000 (1.10034 0 0))
    (5.15000 (1.10302 0 0))
    (5.20000 (1.10568 0 0))
    (5.25000 (1.10832 0 0))
    (5.30000 (1.11094 0 0))
    (5.35000 (1.11354 0 0))
    (5.40000 (1.11613 0 0))
    (5.45000 (1.11870 0 0))
    (5.50000 (1.12125 0 0))
    (5.55000 (1.12378 0 0))
    (5.60000 (1.12630 0 0))
    (5.65000 (1.12880 0 0))
    (5.70000 (1.13128 0 0))
    (5.75000 (1.13374 0 0))
    (5.80000 (1.13619 0 0))
    (5.85000 (1.13863 0 0))
    (5.90000 (1.14105 0 0))
    (5.95000 (1.14345 0 0))
    (6.00000 (1.14584 0 0))
    (6.05000 (1.14821 0 0))
    (6.10000 (1.15057 0 0))
    (6.15000 (1.15291 0 0))
    (6.20000 (1.15524 0 0))
    (6.25000 (1.15756 0 0))
    (6.30000 (1.15986 0 0))
    (6.35000 (1.16215 0 0))
    (6.40000 (1.16442 0 0))
    (6.45000 (1.16669 0 0))
    (6.50000 (1.16893 0 0))
    (6.55000 (1.17117 0 0))
    (6.60000 (1.17339 0 0))
    (6.65000 (1.17560 0 0))
    (6.70000 (1.17780 0 0))
    (6.75000 (1.17999 0 0))
    (6.80000 (1.18216 0 0))
    (6.85000 (1.18432 0 0))
    (6.90000 (1.18647 0 0))
    (6.95000 (1.18861 0 0))
    (7.00000 (1.19073 0 0))
    (7.05000 (1.19285 0 0))
    (7.10000 (1.19495 0 0))
    (7.15000 (1.19704 0 0))
    (7.20000 (1.19913 0 0))
    (7.25000 (1.20120 0 0))
    (7.30000 (1.20326 0 0))
    (7.35000 (1.20531 0 0))
    (7.40000 (1.20735 0 0))
    (7.45000 (1.20937 0 0))
    (7.50000 (1.21139 0 0))
    (7.55000 (1.21340 0 0))
    (7.60000 (1.21540 0 0))
    (7.65000 (1.21739 0 0))
    (7.70000 (1.21937 0 0))
    (7.75000 (1.22134 0 0))
    (7.80000 (1.22330 0 0))
    (7.85000 (1.22525 0 0))
    (7.90000 (1.22719 0 0))
    (7.95000 (1.22912 0 0))
    (8.00000 (1.23104 0 0))
    (8.05000 (1.23296 0 0))
    (8.10000 (1.23486 0 0))
    (8.15000 (1.23676 0 0))
    (8.20000 (1.23865 0 0))
    (8.25000 (1.24052 0 0))
    (8.30000 (1.24239 0 0))
    (8.35000 (1.24426 0 0))
    (8.40000 (1.24611 0 0))
    (8.45000 (1.24795 0 0))
    (8.50000 (1.24979 0 0))
    (8.55000 (1.25162 0 0))
    (8.60000 (1.25344 0 0))
    (8.65000 (1.25525 0 0))
    (8.70000 (1.25706 0 0))
    (8.75000 (1.25886 0 0))
    (8.80000 (1.26065 0 0))
    (8.85000 (1.26243 0 0))
    (8.90000 (1.26420 0 0))
    (8.95000 (1.26597 0 0))
    (9.00000 (1.26773 0 0))
    (9.05000 (1.26948 0 0))
    (9.10000 (1.27123 0 0))
    (9.15000 (1.27297 0 0))
    (9.20000 (1.27470 0 0))
    (9.25000 (1.27642 0 0))
    (9.30000 (1.27814 0 0))
    (9.35000 (1.27985 0 0))
    (9.40000 (1.28155 0 0))
    (9.45000 (1.28325 0 0))
    (9.50000 (1.28493 0 0))
    (9.55000 (1.28662 0 0))
    (9.60000 (1.28829 0 0))
    (9.65000 (1.28996 0 0))
    (9.70000 (1.29163 0 0))
    (9.75000 (1.29328 0 0))
    (9.80000 (1.29493 0 0))
    (9.85000 (1.29658 0 0))
    (9.90000 (1.29822 0 0))
    (9.95000 (1.29985 0 0))
    (10.00000 (1.30147 0 0))
    (10.05000 (1.30309 0 0))
    (10.10000 (1.30471 0 0))
    (10.15000 (1.30631 0 0))
    (10.20000 (1.30791 0 0))
    (10.25000 (1.30951 0 0))
    (10.30000 (1.31110 0 0))
    (10.35000 (1.31268 0 0))
    (10.40000 (1.31426 0 0))
    (10.45000 (1.31583 0 0))
    (10.50000 (1.31740 0 0))
    (10.55000 (1.31896 0 0))
    (10.60000 (1.32052 0 0))
    (10.65000 (1.32207 0 0))
    (10.70000 (1.32361 0 0))
    (10.75000 (1.32515 0 0))
    (10.80000 (1.32669 0 0))
    (10.85000 (1.32822 0 0))
    (10.90000 (1.32974 0 0))
    (10.95000 (1.33126 0 0))
    (11.00000 (1.33277 0 0))
    (11.05000 (1.33428 0 0))
    (11.10000 (1.33578 0 0))
    (11.15000 (1.33728 0 0))
    (11.20000 (1.33877 0 0))
    (11.25000 (1.34026 0 0))
    (11.30000 (1.34174 0 0))
    (11.35000 (1.34322 0 0))
    (11.40000 (1.34469 0 0))
    (11.45000 (1.34616 0 0))
    (11.50000 (1.34762 0 0))
    (11.55000 (1.34908 0 0))
    (11.60000 (1.35054 0 0))
    (11.65000 (1.35198 0 0))
    (11.70000 (1.35343 0 0))
    (11.75000 (1.35487 0 0))
    (11.80000 (1.35630 0 0))
    (11.85000 (1.35773 0 0))
);
        direction       (0 0 1);
        origin          0;
    }
    outlet    { type inletOutlet; inletValue uniform (0 0 0); value uniform (0 0 0); }
    ground    { type noSlip; }
    buildings { type noSlip; }
    top       { type slip; }
    sides     { type symmetry; }
}

// ************************************************************************* //
